# Dealing with NaN

In [1]:
import pandas as pd

In [2]:
# We create a list of Python dictionaries
items2 = [{'bikes': 20, 'pants': 30, 'glasses': 50,'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10,  'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

# We create a DataFrame  and provide the row index
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])

# We display the DataFrame
store_items

         bikes  pants  glasses  watches  shirts  shoes  suits
store 1     20     30     50.0       35    15.0      8   45.0
store 2     15      5      NaN       10     2.0      5    7.0
store 3     20     30      4.0       35     NaN     10    NaN

# How to count the number of NaN values in store_items ?

In [5]:
# We count the number of NaN values in store_items
x =  store_items.isnull().sum().sum()

# We print x
print('Number of NaN values in our DataFrame:\n', x)

Number of NaN values in our DataFrame:
 3

##  Number of non-NaN values in our DataFrame

In [7]:
# We print the number of non-NaN values in our DataFrame
print()
print('Number of non-NaN values in the columns of our DataFrame:\n', store_items.count().sum())

Number of non-NaN values in the columns of our DataFrame:
 18

## How to drop any rows  or columns with NaN values ?

In [8]:
# We drop any rows with NaN values
store_items.dropna(axis = 0)

         bikes  pants  glasses  watches  shirts  shoes  suits
store 1     20     30     50.0       35    15.0      8   45.0

In [9]:
# We drop any columns with NaN values
store_items.dropna(axis = 1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

## Replace all NaN values with 0

In [10]:
# We replace all NaN values with 0
store_items.fillna(0)

         bikes  pants  glasses  watches  shirts  shoes  suits
store 1     20     30     50.0       35    15.0      8   45.0
store 2     15      5      0.0       10     2.0      5    7.0
store 3     20     30      4.0       35     0.0     10    0.0

In [12]:
store_items.mean()

bikes      18.333333
pants      21.666667
glasses    27.000000
watches    26.666667
shirts      8.500000
shoes       7.666667
suits      26.000000
dtype: float64

In [13]:
store_items.fillna(store_items.mean())

         bikes  pants  glasses  watches  shirts  shoes  suits
store 1     20     30     50.0       35    15.0      8   45.0
store 2     15      5     27.0       10     2.0      5    7.0
store 3     20     30      4.0       35     8.5     10   26.0

## Using linear interpolation to replace NaN

In [36]:
# We replace NaN values by using linear interpolation using column values
store_items.interpolate(method = 'linear', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     27.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [14]:
# We replace NaN values by using linear interpolation using row values
store_items.interpolate(method = 'linear', axis = 1)

         bikes  pants  glasses  watches  shirts  shoes  suits
store 1   20.0   30.0     50.0     35.0    15.0    8.0   45.0
store 2   15.0    5.0      7.5     10.0     2.0    5.0    7.0
store 3   20.0   30.0      4.0     35.0    22.5   10.0   10.0

## Quiz

In [23]:
import pandas as pd
import numpy as np



# Create a Pandas DataFrame that contains the ratings some users have given to a
# series of books. The ratings given are in the range from 1 to 5, with 5 being
# the best score. The names of the books, the authors, and the ratings of each user
# are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])

# Users that have np.nan values means that the user has not yet rated that book.
# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. Let Pandas
# automatically assign numerical row indices to the DataFrame. 

# Create a dictionary with the data given above
dat = 

# Use the dictionary to create a Pandas DataFrame
book_ratings = 

# If you created the dictionary correctly you should have a Pandas DataFrame
# that has column labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3',
# 'User 4' and row indices 0 through 4.

# Now replace all the NaN values in your DataFrame with the average rating in
# each column. Replace the NaN values in place. HINT: you can use the fillna()
# function with the keyword inplace = True, to do this. Write your code below:

SyntaxError: invalid syntax (<ipython-input-23-151c8fdfa38d>, line 27)